// Даны два положительных целых числа, представленных в виде строк. Необходимо получить сумму чисел, которые представлены этими строками. Причем полученная сумма должна быть преобразована в строку.
// Для решения этой задачи запрещено преобразовывать входные строки сразу напрямую в целое число при помощи встроенной функции. Необходимо сделать это самостоятельно.

// Пример 1:
// Входные значения: num1 = "11", num2 = "123"
// Результат: "134"

// Пример 2:
// Входные значения: num1="456", num2 = "77"
// Результат: "533"

// Пример 3:
// Входные значения: num1 = "0", num2 = "0"
// Результат: "0"

